
const nom = 0;
const gen = 1;
const dat = 2;
const acc = 3;

var m_article = [
    ['ὁ','οἱ'],
    ['τοῦ','τῶν'],
    ['τῷ','τοῖς'],
    ['τόν','τούς']
]
var f_article = [
    ['ἡ','αἱ'],
    ['τῆς','τῶν'],
    ['τῇ','ταῖς'],
    ['τήν','τάς']
]
var n_article = [
    ['τό','τά'],
    ['τοῦ','τῶν'],
    ['τῷ','τοῖς'],
    ['τό','τά']
]
var aytow = [
    ['αὐτός','αὐτοί'],
    ['αὐτοῦ','αὐτῶν'],
    ['αὐτῷ','αὐτοῖς'],
    ['αὐτόν','αὐτούς']
]
var ayth = [
    ['αὐτή','αὐταί'],
    ['αὐτῆς','αὐτῶν'],
    ['αὐτῇ','αὐταῖς'],
    ['αὐτήν','αὐτάν']
]

/* masculine */
var oikow = [
    ['οἶκος','οἶκοι'],
    ['οἴκου','οἴκων'],
    ['οἴκῳ','οἴκοις'],
    ['οἶκον','οἴκους']
]
var hippow = [
    ['ἵππος','ἵπποι'],
    ['ἵππου','ἵππων'],
    ['ἵππῳ','ἵπποις'],
    ['ἵππον','ἵππους']
]
var kamhlow = [
    ['κάμηλος','κάμηλοι'],
    ['καμήλου','καμήλων'],
    ['καμήλῳ','καμήλοις'],
    ['κάμηλον','καμήλους']
]
var anurvpow = [
    ['ἀδελφός','ἀδελφοί'],
    ['ἀδελφοῦ','ἀδελφῶν'],
    ['ἀδελφῷ','ἀδελφοῖς'],
    ['ἀδελφόν','ἀδελφούς']
]
var levn = [
    ['λέων','λέοντες'],
    ['λέοντος','λεόντων'],
    ['λέοντι','λέουσιν || λέουσι'],
    ['λέοντα','λέοντας']
]
/* feminine */
var phra = [
    ['πῆρα','πῆραι'],
    ['πήρας','πηρῶν'],
    ['πήρᾳ','πήραις'],
    ['πῆραν','πήρας']
]
var kauedra = [
    ['καθέδρα','καθέδαι'],
    ['καθέδρας','καθεδρῶν'],
    ['καθέδρᾳ','καθέδραις'],
    ['καθέδραν','καθέδρας']
]
var trapeza = [
    ['τράπεζα','τρέπεζαι'],
    ['τραπέζης','τραπεζῶν'],
    ['τραπέζῃ','τραπέζαις'],
    ['τράπεζαν','τραπέζας']
]
/* neuter */
var pothrion = [
    ['ποτήριον','ποτήρια'],
    ['ποτηρίου','ποτηρίων'],
    ['ποτηρίῳ','ποτηρίοις'],
    ['ποτήριον','ποτήρια']
]
var probaton = [
    ['πρόβατον','πρόβατα'],
    ['προβάτου','προβάτων'],
    ['προβάτῳ','προβάτοις'],
    ['πρόβατον','πρόβατα']
]
var biblion = [
    ['βιβλίον','βιβλία'],
    ['βιβλίου','βιβλίων'],
    ['βιβλίῳ','βιβλίοις'],
    ['βιβλίον','βιβλία']
]
var stoma = [
    ['στόμα','στόματα'],
    ['στόματος','στομάτων'],
    ['στόματι','στόμασιν'],
    ['στόμα','στόματα']
]